<a href="https://colab.research.google.com/github/noushadkhan01/kansepur-flyash-project/blob/master/bill4/15_31_jan_bill4.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
!git clone https://github.com/noushadkhan01/kansepur-flyash-project.git

Cloning into 'kansepur-flyash-project'...
remote: Enumerating objects: 133, done.
remote: Counting objects: 100% (133/133), done.
remote: Compressing objects: 100% (121/121), done.
remote: Total 233 (delta 61), reused 0 (delta 0), pack-reused 100
Receiving objects: 100% (233/233), 590.94 KiB | 2.95 MiB/s, done.
Resolving deltas: 100% (102/102), done.

In [0]:
import pandas as pd

In [3]:
%cd ./kansepur-flyash-project/bill4/

/content/kansepur-flyash-project/bill4

In [4]:
!ls

14_31_jan_bill4.ipynb  kansepur_bill4.xlsx

In [5]:
df = pd.read_excel('kansepur_bill4.xlsx', 'Sheet1')
df.head()

   S.No.       Date  Count      Name  Quantity
0    1.0 2019-01-15    1.0  mustakim       405
1    2.0        NaT    2.0    shabir       470
2    3.0        NaT    3.0     isran       470
3    4.0        NaT    4.0   farookh       420
4    5.0        NaT    5.0     aarif       416

In [6]:
df.tail(2)

     S.No. Date  Count     Name  Quantity
398  399.0  NaT   53.0  mehmood       405
399    NaN  NaT    NaN      NaN    178137

In [7]:
df = df[:-1]
df.tail(1)

     S.No. Date  Count     Name  Quantity
398  399.0  NaT   53.0  mehmood       405

In [8]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 399 entries, 0 to 398
Data columns (total 5 columns):
S.No.       399 non-null float64
Date        12 non-null datetime64[ns]
Count       399 non-null float64
Name        399 non-null object
Quantity    399 non-null int64
dtypes: datetime64[ns](1), float64(2), int64(1), object(1)
memory usage: 15.7+ KB

In [9]:
unique_dates = df.Date.unique()
unique_dates = pd.Series(unique_dates).dropna()
print(unique_dates)

0    2019-01-15
2    2019-01-16
3    2019-01-20
4    2019-01-21
5    2019-01-24
6    2019-01-25
7    2019-01-26
8    2019-01-27
9    2019-01-28
10   2019-01-29
11   2019-01-30
12   2019-01-31
dtype: datetime64[ns]

In [10]:
df.Date.nunique()

12

In [11]:
df.Date.value_counts()

2019-01-21    1
2019-01-24    1
2019-01-27    1
2019-01-30    1
2019-01-16    1
2019-01-25    1
2019-01-28    1
2019-01-31    1
2019-01-20    1
2019-01-26    1
2019-01-29    1
2019-01-15    1
Name: Date, dtype: int64

In [0]:
import numpy as np

### Fill Date

In [0]:
for n, i in enumerate(df.Date.values):
  if not pd.isnull(i):
    date = i
  else:
    df.iloc[n, 0] = date

In [14]:
df.head(2)

                           S.No.       Date  Count      Name  Quantity
0                              1 2019-01-15    1.0  mustakim       405
1  2019-01-15T00:00:00.000000000        NaT    2.0    shabir       470

In [15]:
df.Name.unique()

array(['mustakim', 'shabir', 'isran', 'farookh', 'aarif', 'toheed',
       'kayum', 'intazar', 'rasid', 'wajid', 'hasan', 'rafakat', 'haseen',
       'aashu', 'gulfam', 'irsad', 'mehmood', 'jabir', 'shokeen', 'momin',
       'khurseed', 'anwar', 'amjad'], dtype=object)

In [16]:
sum(df.Quantity)

178137

In [17]:
quantity_per_name = df.Name.value_counts()
quantity_per_name

rasid       29
hasan       29
farookh     28
isran       27
haseen      25
gulfam      23
momin       22
khurseed    21
mustakim    21
toheed      21
shokeen     21
irsad       17
wajid       16
rafakat     15
aashu       15
aarif       15
jabir       12
shabir      12
mehmood      8
amjad        8
anwar        7
kayum        6
intazar      1
Name: Name, dtype: int64

### Counts per Date

In [18]:
df.isnull().sum()

S.No.         0
Date        387
Count         0
Name          0
Quantity      0
dtype: int64

## unique feets per name

In [19]:
group = df.groupby(df.Name)
group

for i, j in group:
  print(i, '\n', j.Quantity, '\n')

In [21]:
for i, j in group:
  print(i, j.Quantity.unique(), '\n')

aarif [416]

aashu [430]

amjad [411]

anwar [395]

farookh [420]

gulfam [500]

hasan [538 498 508 488 518]

haseen [496]

intazar [517]

irsad [435]

isran [470]

jabir [419]

kayum [450]

khurseed [410 380 455]

mehmood [420 470 500 538 415 419 405]

momin [415]

mustakim [405]

rafakat [538]

rasid [410]

shabir [470]

shokeen [453]

toheed [486 320]

wajid [419]

# Diesel

In [22]:
diesel = pd.read_excel('kansepur_bill4.xlsx', 'Diesel')
diesel.head()

,Name,2019-01-15 00:00:00,2019-01-16 00:00:00,2019-01-20 00:00:00,2019-01-21 00:00:00,2019-01-24 00:00:00
0,aarif,2000,0,0,0,NaN
1,aashu,2000,2000,0,0,NaN
2,farookh,2000,0,0,2000,NaN
3,gulfam,2000,0,2000,2000,NaN
4,hasan,2000,1730,1500,1500,NaN

In [23]:
diesel.shape

(24, 6)

In [24]:
df.head(2)

                           S.No.       Date  Count      Name  Quantity
0                              1 2019-01-15    1.0  mustakim       405
1  2019-01-15T00:00:00.000000000        NaT    2.0    shabir       470

# Total Quantity per name

In [0]:
name_groups = df.groupby('Name')
name_total_quantity = pd.DataFrame(columns = ['Name', 'Total Quantity'])
for i, j in name_groups:
  name_total_quantity = name_total_quantity.append({'Name':i, 'Total Quantity': sum(j.Quantity)}, ignore_index = True)
  
name_total_quantity.sort_values(by = ['Total Quantity'], ascending = False, inplace = True)

In [26]:
name_total_quantity

        Name Total Quantity
6      hasan          15462
10     isran          12690
7     haseen          12400
18     rasid          11890
4    farookh          11760
5     gulfam          11500
20   shokeen           9513
15     momin           9130
13  khurseed           8805
16  mustakim           8505
17   rafakat           8070
21    toheed           8048
9      irsad           7395
22     wajid           6704
1      aashu           6450
0      aarif           6240
19    shabir           5640
11     jabir           5028
14   mehmood           3637
2      amjad           3288
3      anwar           2765
12     kayum           2700
8    intazar            517

In [27]:
diesel.head(1)

,Name,2019-01-15 00:00:00,2019-01-16 00:00:00,2019-01-20 00:00:00,2019-01-21 00:00:00,2019-01-24 00:00:00
0,aarif,2000,0,0,0,NaN

In [28]:
diesel = diesel[['Name', 'Total Diesel']]
diesel.sort_values(by = 'Total Diesel', ascending = False, inplace = True)
diesel

KeyError: ignored

In [0]:
name_total_quantity.shape

In [0]:
diesel.shape

In [0]:
final = pd.DataFrame(columns = ['Name','Count' , 'Total Quantity', 'Amount', 'Diesel', 'Amount - Diesel','Balance(Amount - Diesel)'])
for i in range(len(name_total_quantity)):
  for j in range(len(diesel)):
    if name_total_quantity.Name[i] == diesel.Name[j]:
      final = final.append({'Name': diesel.Name[j],'Total Quantity':name_total_quantity['Total Quantity'][i] ,
                            'Count':quantity_per_name.get(diesel.Name[j]),
                            'Amount':name_total_quantity['Total Quantity'][i]*3,
                            'Diesel':diesel['Total Diesel'][j],
                            'Amount - Diesel':name_total_quantity['Total Quantity'][i]*3 - diesel['Total Diesel'][j],
                           'Balance(Amount - Diesel)': name_total_quantity['Total Quantity'][i]*3 - diesel['Total Diesel'][j]},
                           ignore_index = True)

In [0]:
final.sort_values(by = 'Total Quantity', ascending = False, inplace = True)
final

In [0]:
final.shape

# Total payable

In [0]:
sum(final['Amount - Diesel'])

# Total Diesel to peoples

In [0]:
sum(final['Diesel'])

In [0]:
to_tractors = sum(final['Total Quantity'])
to_tractors

In [0]:
to_tractors + name_total_quantity[name_total_quantity.Name == 'mehmood']['Total Quantity']